[

     {
        "title" : "Scrum คือ?",
        "subtitle" : "บทความนี้จะแนะนำกระบวนการพัฒนาซอฟต์แวร์แบบสกรัม",
        "image_url" : "https://cdn.pixabay.com/photo/2015/04/20/13/17/work-731198_960_720.jpg",
        "detail" : "สกรัม (อังกฤษ: Scrum) เป็นหนึ่งในกลุ่มของระเบียบวิธีการพัฒนาซอฟต์แวร์ ซึ่งเป็นที่รู้จักมากนิยมมากที่สุดในกลุ่มวิธีการพัฒนาซอฟต์แวร์แบบเอจายล์(Agile software development)[1][2] ระเบียบวิธีการพัฒนาซอฟต์แวร์แบบสกรัมนั้น เป็นเอจายล์รูปแบบหนึ่งที่มุ่งเน้นการบริหารโครงพัฒนาซอฟต์แวร์ และเป็นระเบียบวิธีที่เพิ่มอัตราความสำเร็จในการพัฒนาซอฟต์แวร์ไปพร้อมกัน ซึ่งแตกต่างจากเอจายล์แบบ Extreme programming (XP) ซึ่งมุ่งเน้นการปฏิบัติ (practices) มากกว่าการบริหารโครงการ"
    },
    {
        "title" : "DevOps คือ?",
        "subtitle" : "รูปแบบการทำงานระหว่างทีม Development และ IT Operation",
        "image_url" : "https://cdn.pixabay.com/photo/2014/03/22/22/17/phone-292994_960_720.jpg",
        "detail" : "DevOps คือการผสมผสานแนวความคิดเชิงวัฒนธรรม แนวทางปฏิบัติ และเครื่องมือต่างๆ ที่ช่วยเพิ่มความสามารถขององค์กรในการส่งมอบแอปพลิเคชันและบริการอย่างรวดเร็ว โดยพัฒนาและปรับปรุงผลิตภัณฑ์ต่างๆ ให้เร็วกว่ากระบวนการการพัฒนาซอฟต์แวร์และการจัดการโครงสร้างพื้นฐานแบบดั้งเดิม ความรวดเร็วนี้ช่วยให้องค์กรสามารถให้บริการแก่ลูกค้าของตนได้ดีขึ้น และสามารถแข่งขันในตลาดได้อย่างมีประสิทธิภาพมากขึ้น"
    },
    {
        "title" : "Agile คือ?",
        "subtitle" : "แนวคิดในการพัฒนาซอฟต์แวร์ที่ได้รับความนิยมทั่วโลก",
        "image_url" : "https://cdn.pixabay.com/photo/2016/11/29/06/18/home-office-1867761_960_720.jpg",
        "detail" : "Agile แนวคิดที่ช่วยให้ทำงานได้เร็วขึ้น โดยลดการทำงานที่เป็นขั้นตอนและงานด้านเอกสารลง และมุ่งเน้นเรื่องการสื่อสารกันในทีมให้มากขึ้น เพื่อร่วมกันพัฒนาผลิตภัณฑ์ให้เร็วขึ้น พร้อมนำมาทดสอบ และเก็บผลตอบรับต่าง ๆ กลับไปแก้ไขปรับปรุง เพื่อให้เกิดการพัฒนาสินค้าและบริการใหม่ๆ ได้รวดเร็วขึ้น"
    }    ,
    {
        "title" : "Kanban คือ?",
        "subtitle" : "เป็นระบบการจัดตารางเวลาสำหรับการผลิตแบบลีนและการผลิตแบบทันเวลาพอดี (JIT)",
        "image_url" : "https://cdn.pixabay.com/photo/2016/11/29/06/18/home-office-1867761_960_720.jpg",
        "detail" : "Kanban ( ญี่ปุ่น :看板ความหมายป้ายหรือป้าย ) เป็นวิธีการผลิตแบบลีนในการจัดการและปรับปรุงการทำงานของมนุษย์ทั่วทั้งระบบ วิธีการนี้มีจุดมุ่งหมายในการจัดการงานโดยสมดุลกับความต้องการที่มีความจุที่มีอยู่และโดยการปรับปรุงการจัดการของระบบระดับคอขวด"
    }
]



